www/lrn/lisp/lisp-7.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org95f7137">План работ</a></li>
<li><a href="#orge382a0e">Глобальное окружение</a></li>
<li><a href="#orgf00aba2">Функции для тестирования</a></li>
<li><a href="#org046a794">Структура замыкания</a></li>
<li><a href="#org7f46111">MyApply</a>
<ul>
<li><a href="#org9dcec58">Работа с CONS-ячейками</a></li>
<li><a href="#org8a1d837">NULL-предикат</a></li>
<li><a href="#org986c4d8">Встроенные функции арифметики</a></li>
<li><a href="#org4322245">CLOSURE</a></li>
<li><a href="#org5af975f">PRINT</a></li>
<li><a href="#orgbb60361">LIST</a></li>
</ul>
</li>
<li><a href="#org97b46cf">MyEval</a>
<ul>
<li><a href="#org180a697">Самовычисляемые формы</a></li>
<li><a href="#orgdb3bb2b">Вычисление символов</a></li>
<li><a href="#orgd85fdf9">Цитирование</a></li>
<li><a href="#orgaa02628">Условное выполнение IF</a></li>
<li><a href="#orgcc47078">COND</a></li>
<li><a href="#orgc9e40e3">PROGN</a></li>
<li><a href="#orgad85d37">AND</a></li>
<li><a href="#org4ecbaa1">OR</a></li>
<li><a href="#orgf9ee1ef">LET</a></li>
<li><a href="#org423cf0c">LET*</a></li>
<li><a href="#orga38d905">DEFUN</a></li>
<li><a href="#orgf7306b8">SETQ</a></li>
<li><a href="#orgd9380cd">LAMBDA</a></li>
<li><a href="#orgaf6ce7d">BLOCK</a></li>
<li><a href="#org0be8462">RETURN-FROM</a></li>
<li><a href="#orgf503bbf">CATCH</a></li>
<li><a href="#org92f7c5c">THROW</a></li>
<li><a href="#org6798237">TAGBODY</a></li>
<li><a href="#orgdfc688f">GO</a></li>
<li><a href="#org049adde">LABELS</a></li>
</ul>
</li>
<li><a href="#org155f1cb">REPL</a></li>
<li><a href="#org5ca7927">Итоги</a></li>
</ul>
</div>
</div>

<div id="outline-container-org95f7137" class="outline-2">
<h2 id="org95f7137">План работ</h2>
<div class="outline-text-2" id="text-org95f7137">
<p>
На предыдущем этапе мы получили <code>tagbody</code> и <code>go</code>. Но это не позволяет нам создавать
рекурсивные функции, поэтому сейчас мы добавим <code>labels</code>.
</p>
</div>
</div>

<div id="outline-container-orge382a0e" class="outline-2">
<h2 id="orge382a0e">Глобальное окружение</h2>
<div class="outline-text-2" id="text-orge382a0e">
<div class="org-src-container">
<pre class="src src-lisp" id="org3e4ae4e">(defun assoc-2 (key alist cont errcont) ;; NB!: inverted order of
                                        ;; continuations (for lookup)
  (cond ((null alist)              (funcall errcont key))
        ((equal key (caar alist))  (funcall cont    (cdar alist)))
        (t                         (assoc-2 key (cdr alist) cont errcont))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org3caaa77">(assert (equal "ok:123"
               (assoc-2 'alfa '((alfa . 123))
                        (lambda (x) (format nil "ok:~A" x))
                        (lambda (x) (format nil "err:~A" x)))))
(assert (equal "err:ALFA"
               (assoc-2 'alfa '((beta . 123))
                        (lambda (x) (format nil "ok:~A" x))
                        (lambda (x) (format nil "err:~A" x)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org85604e6">;; environment
(defparameter *glob-env* nil)
;; lookup
(defun lookup (symb env errcont cont)
  (assoc-2 symb env cont
           (lambda (key)
             (assoc-2 key *glob-env* cont
                      (lambda (key)
                        (funcall errcont
                                 (format
                                  nil
                                  "UNBOUD VARIABLE [~A] ~%LOCAL ENV: [~A] ~%GLOBAL ENV: [~A]"
                                  key env *glob-env*)))))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="orgde0059a">;; test lookup
(assert (equal "ok:123" (lookup 'aaa '((aaa . 123))
                                (lambda (x) (format nil "err:~A" x))
                                (lambda (x) (format nil "ok:~A" x)))))
(assert (equal nil      (lookup 'aaa '((bbb . 123))
                                (lambda (x) (declare (ignore x)) nil)
                                (lambda (x) (format nil "ok:~A" x)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf00aba2" class="outline-2">
<h2 id="orgf00aba2">Функции для тестирования</h2>
<div class="outline-text-2" id="text-orgf00aba2">
<div class="org-src-container">
<pre class="src src-lisp" id="org29b6712">(defun ok (x)
  (format t "~%ok: ~A" x)
  x)
(defun err (x)
  (format t "~%err: ~A" x)
  x)
</pre>
</div>
</div>
</div>

<div id="outline-container-org046a794" class="outline-2">
<h2 id="org046a794">Структура замыкания</h2>
<div class="outline-text-2" id="text-org046a794">
<div class="org-src-container">
<pre class="src src-lisp" id="orga451fd5">(defstruct closure
  body
  env
  block-env
  go-env
  args)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f46111" class="outline-2">
<h2 id="org7f46111">MyApply</h2>
<div class="outline-text-2" id="text-org7f46111">
<div class="org-src-container">
<pre class="src src-lisp" id="org4afe8b2">(define-condition unknown-function (error)
  ((fn :initarg :fn  :reader fn))
  (:report
   (lambda (condition stream)
     (format stream "Error in MYAPPLY: unknown-function: ~A"
             (fn condition)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org895625e">&lt;&lt;evaddmul_7&gt;&gt;
&lt;&lt;evlis_7&gt;&gt;
(defun myapply (fn args catch-env errcont cont)
  (cond
    &lt;&lt;myapply_car_cdr_cons_7&gt;&gt;
    &lt;&lt;myapply_null_7&gt;&gt;
    &lt;&lt;myapply_ariph_7&gt;&gt;
    &lt;&lt;myapply_closure_7&gt;&gt;
    &lt;&lt;myapply_print_7&gt;&gt;
    &lt;&lt;myapply_list_7&gt;&gt;
    (t (error 'unknown-function :fn fn))))
</pre>
</div>


<div class="org-src-container">
<pre class="src src-lisp" id="orgdde5706">&lt;&lt;myapply_car_cdr_cons_7_test&gt;&gt;
&lt;&lt;myapply_null_7_test&gt;&gt;
&lt;&lt;evaddmul_7_test&gt;&gt;
&lt;&lt;myapply_ariph_7_test&gt;&gt;
&lt;&lt;myapply_closure_7_test&gt;&gt;
&lt;&lt;myapply_print_7_test&gt;&gt;
&lt;&lt;myapply_evlis_7_test&gt;&gt;
&lt;&lt;myapply_list_7_test&gt;&gt;
</pre>
</div>
</div>

<div id="outline-container-org9dcec58" class="outline-3">
<h3 id="org9dcec58">Работа с CONS-ячейками</h3>
<div class="outline-text-3" id="text-org9dcec58">
<div class="org-src-container">
<pre class="src src-lisp" id="org4315c67">((equal fn 'car)             (funcall cont (caar args)))
((equal fn 'cdr)             (funcall cont (cdar args)))
((equal fn 'cons)            (funcall cont (cons (car args) (cadr args))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp" id="org14a9f7c">;; Тесты cons, car, cdr
(assert (equal '(1 . 2) (myeval '(cons 1 2) nil nil nil nil #'err #'ok)))
(assert (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)) nil nil nil nil #'err #'ok)))
(assert (equal 2 (myeval '(car (cons 2 3)) nil nil nil nil #'err #'ok)))
(assert (equal 3 (myeval '(cdr (cons 2 3)) nil nil nil nil #'err #'ok)))
(assert (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))) nil nil nil nil #'err #'ok)))
(assert (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))) nil nil nil nil #'err #'ok)))
;; Тесты для cons-ячеек, вычисляемых в окружении
(assert (equal 1 (myeval '(car a) '((a . (1 . 2))) nil nil nil #'err #'ok)))
(assert (equal 2 (myeval '(cdr a) '((a . (1 . 2))) nil nil nil #'err #'ok)))
(assert (equal 3 (myeval '(car b) '((a . (1 . 2)) (b . (3 . 4))) nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>
